index.org
#+TITLE:Databases (CS53001 Spring 2013)

* Publish and rsync code					   :noexport:

#+begin_src emacs-lisp :results silent :exports none
  (require 'org-publish)
  (setq org-publish-project-alist
        '(("cspp53001-org"
           :base-directory "./"
           :base-extension "org"
           ; :include "\\(index\\|hw[1234]\\|mysql-[^.]+\\)\\.org"
           :publishing-directory "./public_html/"
           ; :publishing-directory "/ssh:classes:/stage/cspp53001"
           :recursive t
           :publishing-function org-html-publish-to-html
           :headline-levels 4       ; Just the default for this project.
           :section-numbers nil
           :with-sub-superscript nil
           :auto-preamble t)
          ("cspp53001-images"
           :base-directory "./images/"
           :base-extension "png"
           :publishing-directory "./public_html/images/"
           :publishing-function org-publish-attachment)
          ("cspp53001-examples"
           :base-directory "./hw7/"
           :base-extension any
           :publishing-directory "./public_html/hw7/"
           :publishing-function org-publish-attachment)
          ("cspp53001" :components ("cspp53001-org" "cspp53001-images" "cspp53001-examples"))))
#+end_src

#+BEGIN_SRC sh :results output
  rsync -avz --files-from=files public_html/ classes:/stage/cspp53001
#+END_SRC

#+RESULTS:
: building file list ... done
: hw7.html
: 
: sent 1439 bytes  received 120 bytes  164.11 bytes/sec
: total size is 127154  speedup is 81.56

* Textbooks

[[http://infolab.stanford.edu/~ullman/fcdb.html][A First Course in Database Systems]] (3rd ed.)  
by Jeff Ullman and Jennifer Widom (U&W)

[[http://dbtextbook.com/][Database Systems, Introduction to Databases and Data Warehouses]] 
by Nenad Jukić, Susan Vrbsky, and Svetlozar Nestorov (JV&N)


* Academic Policies

[[http://studentmanual.uchicago.edu/Policies][Academic Policies & Requirements at UChicago]]


* Grades


|--------------+-----|
| Problem sets | 25% |
| Midterm exam | 25% |
| Term project | 50% |
|--------------+-----|

Assignments will include problem sets and term project tasks.

Work submitted late without prior arrangements or extenuating
circumstances will not receive full credit.



* Readings

|------+------------------+------------------------------------------+------+---------------------------|
| Week | Date             | Topics                                   | JV&N | U&W                       |
|------+------------------+------------------------------------------+------+---------------------------|
|      |                  | <40>                                     |      |                           |
|    1 | <2013-04-04 Thu> | Introduction, Entity-Relationship model and design | 1, 2 | 1, 4.1-4.4                |
|    2 | <2013-04-11 Thu> | Database design, Relational model, Functional dependencies | 3, 4 | 2.1-2.2, 4.5-4.6, 3.1-3.5 |
|    3 | <2013-04-18 Thu> | Normal forms, +Relational algebra+, SQL: Schemas, Simple queries | 4, 5 | 2.3-2.5, 5, 6.1-6.2       |
|    4 | <2013-04-25 Thu> | SQL: Subqueries, Aggregation, Modifications | 5    | 6.2-6.5                   |
|    5 | <2013-05-02 Thu> | SQL: Joins, Views, Indexes, Constraints  | 5, 6 | 6.3, 7.1-7.2, 8.1-8.4     |
|    6 | <2013-05-09 Thu> | *Midterm;* Transactions, Authorization   | 10   | 6.6, 10.1                 |
|    7 | <2013-05-16 Thu> | Midterm review; +Triggers, Stored procedures+; Project design review |      | +7.5, 9.1-9.4+            |
|    8 | <2013-05-23 Thu> | Database connectivity, Web programming   |      | 9.5-9.7, class notes      |
|    9 | <2013-05-30 Thu> | Data warehousing, Data mining            |      | class notes               |
|   10 | <2013-06-06 Thu> | NoSQL Databases, Big Data                |      | class notes               |
|      | <2013-06-12 Wed> | Final project deadline!                  |      |                           |
|------+------------------+------------------------------------------+------+---------------------------|
#+TBLFM: 


* HowTos

[[file:mysql-intro.org][Getting Started With MySQL]]

[[file:mysql-load.org][Loading Data in MySQL]]

[[file:mysql-option.org][MySQL Option Files]]

[[http://dev.mysql.com/doc/refman/5.5/en/tutorial.html][MySQL 5.5 Tutorial]] (external link)


* Assignments

|------+------------------+---------------------+--------------------------|
| Week | Date             | Assignments         | Due                      |
|------+------------------+---------------------+--------------------------|
|    1 | <2013-04-04 Thu> | [[file:hw1.org][hw1]]                 | <2013-04-17 Wed 11:59pm> |
|    q | <2013-04-11 Thu> | [[file:hw2.org][hw2]]                 | <2013-04-24 Wed 11:59pm> |
|    3 | <2013-04-18 Thu> |                     |                          |
|    4 | <2013-04-25 Thu> | [[file:hw3.org][hw3]]                 | <2013-05-02 Thu 11:59am> |
|    5 | <2013-05-02 Thu> | [[file:hw4.org][hw4]]                 | <2013-05-09 Thu 11:59am> |
|    6 | <2013-05-09 Thu> | [[file:hw5.org][hw5]]                 | <2013-05-17 Fri 11:59pm> |
|    7 | <2013-05-16 Thu> | [[file:hw6.org][hw6]] (extra credit!) | <2013-05-30 Thu 11:59am> |
|    8 | <2013-05-23 Thu> | [[file:hw7.org][hw7]]                 | <2013-05-30 Thu 11:59am> |
|    9 | <2013-05-30 Thu> | [[file:hw8.org][hw8]]                 | <2013-06-06 Thu 11:59am> |
|   10 | <2013-06-06 Thu> |                     |                          |
|      |                  | Projects Due        | <2013-06-12 Wed 11:59pm> |
|------+------------------+---------------------+--------------------------|


