public_html/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Databases (CS53001 Spring 2013)</title>
<!-- 2013-05-09 Thu 19:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Neil Best"/>
</head>
<body>
<div id="content">
<h1 class="title">Databases (CS53001 Spring 2013)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Textbooks</a></li>
<li><a href="#sec-2">Academic Policies</a></li>
<li><a href="#sec-3">Grades</a></li>
<li><a href="#sec-4">Readings</a></li>
<li><a href="#sec-5">HowTos</a></li>
<li><a href="#sec-6">Assignments</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Textbooks</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://infolab.stanford.edu/~ullman/fcdb.html">A First Course in Database Systems</a> (3rd ed.)  
by Jeff Ullman and Jennifer Widom (U&amp;W)
</p>

<p>
<a href="http://dbtextbook.com/">Database Systems, Introduction to Databases and Data Warehouses</a> 
by Nenad Jukić, Susan Vrbsky, and Svetlozar Nestorov (JV&amp;N)
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Academic Policies</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://studentmanual.uchicago.edu/Policies">Academic Policies &amp; Requirements at UChicago</a>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Grades</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="right"/>
</colgroup>
<tbody>
<tr>
<td class="left">Problem sets</td>
<td class="right">25%</td>
</tr>

<tr>
<td class="left">Midterm exam</td>
<td class="right">25%</td>
</tr>

<tr>
<td class="left">Term project</td>
<td class="right">50%</td>
</tr>
</tbody>
</table>

<p>
Assignments will include problem sets and term project tasks.
</p>

<p>
Work submitted late without prior arrangements or extenuating
circumstances will not receive full credit.
</p>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Readings</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="right"/>

<col class="left"/>

<col class="left"/>

<col class="right"/>

<col class="left"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="right">Week</th>
<th scope="col" class="left">Date</th>
<th scope="col" class="left">Topics</th>
<th scope="col" class="right">JV&amp;N</th>
<th scope="col" class="left">U&amp;W</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-04-04 Thu&gt;</span></span></td>
<td class="left">Introduction, Entity-Relationship model and design</td>
<td class="right">1, 2</td>
<td class="left">1, 4.1-4.4</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-04-11 Thu&gt;</span></span></td>
<td class="left">Database design, Relational model, Functional dependencies</td>
<td class="right">3, 4</td>
<td class="left">2.1-2.2, 4.5-4.6, 3.1-3.5</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-04-18 Thu&gt;</span></span></td>
<td class="left">Normal forms, <del>Relational algebra</del>, SQL: Schemas, Simple queries</td>
<td class="right">4, 5</td>
<td class="left">2.3-2.5, 5, 6.1-6.2</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-04-25 Thu&gt;</span></span></td>
<td class="left">SQL: Subqueries, Aggregation, Modifications</td>
<td class="right">5</td>
<td class="left">6.2-6.5</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-02 Thu&gt;</span></span></td>
<td class="left">SQL: Joins, Views, Indexes, Constraints</td>
<td class="right">5, 6</td>
<td class="left">6.3, 7.1-7.2, 8.1-8.4</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-09 Thu&gt;</span></span></td>
<td class="left"><b>Midterm;</b> Transactions, Authorization</td>
<td class="right">10</td>
<td class="left">6.6, 10.1</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-16 Thu&gt;</span></span></td>
<td class="left">Midterm review; <del>Triggers, Stored procedures</del>; Project design review</td>
<td class="right">&#xa0;</td>
<td class="left"><del>7.5, 9.1-9.4</del></td>
</tr>

<tr>
<td class="right">8</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-23 Thu&gt;</span></span></td>
<td class="left">Database connectivity, Web programming</td>
<td class="right">&#xa0;</td>
<td class="left">9.5-9.7, class notes</td>
</tr>

<tr>
<td class="right">9</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-30 Thu&gt;</span></span></td>
<td class="left">Data warehousing, Data mining</td>
<td class="right">&#xa0;</td>
<td class="left">class notes</td>
</tr>

<tr>
<td class="right">10</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-06-06 Thu&gt;</span></span></td>
<td class="left">NoSQL Databases, Big Data</td>
<td class="right">&#xa0;</td>
<td class="left">class notes</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-06-12 Wed&gt;</span></span></td>
<td class="left">Final project deadline!</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">HowTos</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="mysql-intro.html">Getting Started With MySQL</a>
</p>

<p>
<a href="mysql-load.html">Loading Data in MySQL</a>
</p>

<p>
<a href="mysql-option.html">MySQL Option Files</a>
</p>

<p>
<a href="http://dev.mysql.com/doc/refman/5.5/en/tutorial.html">MySQL 5.5 Tutorial</a> (external link)
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Assignments</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="right"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="right">Week</th>
<th scope="col" class="left">Date</th>
<th scope="col" class="left">Assignments</th>
<th scope="col" class="left">Due</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-04-04 Thu&gt;</span></span></td>
<td class="left"><a href="hw1.html">hw1</a></td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-04-17 Wed 11:59pm&gt;</span></span></td>
</tr>

<tr>
<td class="right">q</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-04-11 Thu&gt;</span></span></td>
<td class="left"><a href="hw2.html">hw2</a></td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-04-24 Wed 11:59pm&gt;</span></span></td>
</tr>

<tr>
<td class="right">3</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-04-18 Thu&gt;</span></span></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-04-25 Thu&gt;</span></span></td>
<td class="left"><a href="hw3.html">hw3</a></td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-02 Thu 11:59am&gt;</span></span></td>
</tr>

<tr>
<td class="right">5</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-02 Thu&gt;</span></span></td>
<td class="left"><a href="hw4.html">hw4</a></td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-09 Thu 11:59am&gt;</span></span></td>
</tr>

<tr>
<td class="right">6</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-09 Thu&gt;</span></span></td>
<td class="left"><a href="hw5.html">hw5</a></td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-17 Fri 11:59pm&gt;</span></span></td>
</tr>

<tr>
<td class="right">7</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-16 Thu&gt;</span></span></td>
<td class="left">hw6</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-23 Thu 11:59am&gt;</span></span></td>
</tr>

<tr>
<td class="right">8</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-23 Thu&gt;</span></span></td>
<td class="left">hw7</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-30 Thu 11:59am&gt;</span></span></td>
</tr>

<tr>
<td class="right">9</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-05-30 Thu&gt;</span></span></td>
<td class="left">hw8</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-06-06 Thu 11:59am&gt;</span></span></td>
</tr>

<tr>
<td class="right">10</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-06-06 Thu&gt;</span></span></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Projects Due</td>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-06-12 Wed 11:59pm&gt;</span></span></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Neil Best</p>
<p class="date">Created: 2013-05-09 Thu 19:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.1)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
